Tekla Open API Reference for Tekla Structures 2025
StraightDimension.StraightDimensionAttributes Constructor
Initializes a new instance of the StraightDimension.StraightDimensionAttributes class
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StraightDimensionAttributes()
Public Sub New
See Also
Reference
StraightDimension.StraightDimensionAttributes Class
Tekla.Structures.Drawing Namespace